//Создайте структуру с именем train, содержащую поля: название пункта назначения, номер поезда, время отправления.
//Другой класс: массив из пяти элементов типа train, иметь возможность упорядочить(отсортировать) элементы по номерам поездов.
//Добавить возможность вывода информации о поезде, номер которого введен пользователем.
//Добавить возможность сортировки массив по пункту назначения, причем поезда с одинаковыми пунктами назначения должны быть упорядочены по времени отправления.


// Создать класс с двумя переменными. Добавить функцию вывода на экран и функцию изменения этих переменных.
// Добавить функцию, которая находит сумму значений этих переменных, и функцию которая находит наибольшее значение из этих двух переменных.